app/Views/qurban/v_kelompok_qurban.php

SELECT *
FROM `tbl_peserta_kelompok`
WHERE `id_kelompok` = '47'
---
                                    </tr>
                                    <?php
                                    $db = \config\Database::connect();
                                    $pesertaQuery = $db->table('tbl_peserta_kelompok')
                                        ->where('id_kelompok', $value['id_kelompok'])
                                        ->get();

SELECT `tbl_peserta_kelompok`.`id_kelompok`, SUM(`tbl_peserta_kelompok`.`biaya`) AS `biaya`
FROM `tbl_peserta_kelompok`
WHERE `id_kelompok` = '47'
GROUP BY `tbl_peserta_kelompok`.`id_kelompok`
---
                                            ->select('tbl_peserta_kelompok.id_kelompok')
                                            ->groupBy('tbl_peserta_kelompok.id_kelompok')
                                            ->selectSum('tbl_peserta_kelompok.biaya');
                                        $biayaRow = $biayaQuery->get()->getRowArray();