app/Models/ModelKasYatim.php

SELECT *
FROM `tbl_kas_yatim`
---
    public function AllData()
    {
        return $this->db->table('tbl_kas_yatim')
            ->get()->getResultArray();