app/Models/ModelPesertaQurban.php

    public function AllDataKelompok($id_tahun)
    {
        return $this->db->table('tbl_kelompok')
            ->where('id_tahun', $id_tahun)
            ->get()->getResultArray();
---
SELECT *
FROM `tbl_kelompok`
WHERE `id_tahun` = '5'