app/Models/ModelAdmin.php

SELECT *
FROM `tbl_setting`
WHERE `id` = 1
---
    public function ViewSetting()
    {
        return $this->db->table('tbl_setting')
            ->where('id', 1)
            ->get()->getRowArray();

UPDATE `tbl_setting` SET `id` = 1, `nama_masjid` = 'MASJID RAYA PAUH KAMBAR BINTUNGAN TINGGI', `id_kota` = '0305', `alamat` = 'Nagari Pauh Kambar Kecamatan Nan Sabaris', `tahunaktif` = '2023'
WHERE `id` = 1
---
    public function UpdateSetting($data)
    {
        $this->db->table('tbl_setting')
            ->where('id', 1)
            ->update($data);

SELECT *
FROM `tbl_kas_masjid`
WHERE month(tanggal) = '09'
AND year(tanggal) = '2023'
---
    public function AllDataKasMasjid()
    {
        return $this->db->table('tbl_kas_masjid')
            ->where('month(tanggal)', date('m'))
            ->where('year(tanggal)', date('Y'))
            ->get()->getResultArray();

SELECT *
FROM `tbl_kas_yatim`
WHERE month(tanggal) = '09'
AND year(tanggal) = '2023'
---
    public function AllDataKasYatim()
    {
        return $this->db->table('tbl_kas_yatim')
            ->where('month(tanggal)', date('m'))
            ->where('year(tanggal)', date('Y'))
            ->get()->getResultArray();