app/Models/ModelTahun.php

SELECT *
FROM `tabel_tahun`
---
    public function AllData()
    {
        return $this->db->table('tabel_tahun')
            ->get()->getResultArray();

SELECT *
FROM `tabel_tahun`
WHERE `id_tahun` = '5'
---
    public function DetailData($id_tahun)
    {
        return $this->db->table('tabel_tahun')
            ->where('id_tahun', $id_tahun)
            ->get()->getRowArray();

SELECT `tahun_m`, `id_tahun`
FROM `tabel_tahun`
---
    public function Selecttahun()
    {
        $query =  $this->db->table('tabel_tahun')
            ->select('tahun_m, id_tahun')