app/Models/ModelKasMasjid.php

    public function AllData()
    {
        return $this->db->table('tbl_kas_masjid')
            ->get()->getResultArray();
---
SELECT *
FROM `tbl_kas_masjid`