app/Views/v_template_admin.php

SELECT *
FROM `tbl_setting`
---
    <?php
    $db = \config\Database::connect();

    $web = $db->table('tbl_setting')->get()->getRowArray();